nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/coex_examples/coex_wifi_edgefast_open/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitDEBUG_UARTPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t RT_P0_31_FC0_RXD = (/* Pin is configured as LP_FLEXCOMM0_P0 */
                                       IOPCTL_PIO_FUNC1 |
                                       /* Disable pull-up / pull-down function */
                                       IOPCTL_PIO_PUPD_DI |
                                       /* Enable pull-down function */
                                       IOPCTL_PIO_PULLDOWN_EN |
                                       /* Enables input buffer function */
                                       IOPCTL_PIO_INBUF_EN |
                                       /* Pseudo Output Drain is disabled */
                                       IOPCTL_PIO_PSEDRAIN_DI |
                                       /* Input function is not inverted */
                                       IOPCTL_PIO_INV_DI |
                                       /* Selects transmitter current drive 100ohm */
                                       IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN31 (coords: V21) is configured as LP_FLEXCOMM0_P0 */
    IOPCTL_PinMuxSet(BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_PORT, BOARD_INITDEBUG_UARTPINS_RT_P0_31_FC0_RXD_PIN, RT_P0_31_FC0_RXD);

    const uint32_t RT_P1_0_FC0_TXD = (/* Pin is configured as LP_FLEXCOMM0_P1 */
                                      IOPCTL_PIO_FUNC1 |
                                      /* Disable pull-up / pull-down function */
                                      IOPCTL_PIO_PUPD_DI |
                                      /* Enable pull-down function */
                                      IOPCTL_PIO_PULLDOWN_EN |
                                      /* Disable input buffer function */
                                      IOPCTL_PIO_INBUF_DI |
                                      /* Pseudo Output Drain is disabled */
                                      IOPCTL_PIO_PSEDRAIN_DI |
                                      /* Input function is not inverted */
                                      IOPCTL_PIO_INV_DI |
                                      /* Selects transmitter current drive 100ohm */
                                      IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN0 (coords: AD25) is configured as LP_FLEXCOMM0_P1 */
    IOPCTL_PinMuxSet(BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_PORT, BOARD_INITDEBUG_UARTPINS_RT_P1_0_FC0_TXD_PIN, RT_P1_0_FC0_TXD);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSDCardPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: C21, peripheral: GPIO7, signal: 'GPIO, 3', pin_signal: PIO7_3/SDHC0_DATA5/LP_FLEXCOMM12_P1}
  - {pin_num: B22, peripheral: USDHC0, signal: USDHC_CLK, pin_signal: PIO7_0/SDHC0_CLK/LP_FLEXCOMM3_P4/LP_FLEXCOMM7_P6, selects_transmitter_current_drive: O_33_or_full,
    input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: B20, peripheral: USDHC0, signal: USDHC_CMD, pin_signal: PIO7_1/SDHC0_CMD/LP_FLEXCOMM3_P5/LP_FLEXCOMM7_P5, selects_transmitter_current_drive: O_33_or_full,
    input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: A22, peripheral: USDHC0, signal: 'USDHC_DATA, 0', pin_signal: PIO7_6/SDHC0_DATA0/LP_FLEXCOMM12_P4, selects_transmitter_current_drive: O_33_or_full,
    input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: A20, peripheral: USDHC0, signal: 'USDHC_DATA, 1', pin_signal: PIO7_7/SDHC0_DATA1/LP_FLEXCOMM12_P5, selects_transmitter_current_drive: O_33_or_full,
    input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: B23, peripheral: USDHC0, signal: 'USDHC_DATA, 3', pin_signal: PIO7_9/SDHC0_DATA3/LP_FLEXCOMM3_P6/LP_FLEXCOMM7_P4, selects_transmitter_current_drive: O_33_or_full,
    input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: C22, peripheral: USDHC0, signal: 'USDHC_DATA, 2', pin_signal: PIO7_8/SDHC0_DATA2/LP_FLEXCOMM12_P6/LP_FLEXCOMM7_P3, selects_transmitter_current_drive: O_33_or_full,
    input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: F18, peripheral: GPIO7, signal: 'GPIO, 11', pin_signal: PIO7_11/SDHC0_CARD_DET_N/LP_FLEXCOMM1_P1}
  - {pin_num: A24, peripheral: GPIO7, signal: 'GPIO, 10', pin_signal: PIO7_10/SDHC0_WR_PRT/LP_FLEXCOMM1_P0/SDHC0_DS}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSDCardPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitSDCardPins(void)
{
    /* Reset IOPCTL2 module */
    RESET_ClearPeripheralReset(kIOPCTL2_RST_SHIFT_RSTn);

    const uint32_t SDHC0_CLK = (/* Pin is configured as SDHC0_CLK */
                                IOPCTL_PIO_FUNC1 |
                                /* Enable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_EN |
                                /* Enable pull-up function */
                                IOPCTL_PIO_PULLUP_EN |
                                /* Enables input buffer function */
                                IOPCTL_PIO_INBUF_EN |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI |
                                /* Selects transmitter current drive 33ohm */
                                IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN0 (coords: B22) is configured as SDHC0_CLK */
    IOPCTL_PinMuxSet(BOARD_INITSDCARDPINS_SDHC0_CLK_PORT, BOARD_INITSDCARDPINS_SDHC0_CLK_PIN, SDHC0_CLK);

    const uint32_t SDHC0_CMD = (/* Pin is configured as SDHC0_CMD */
                                IOPCTL_PIO_FUNC1 |
                                /* Enable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_EN |
                                /* Enable pull-up function */
                                IOPCTL_PIO_PULLUP_EN |
                                /* Enables input buffer function */
                                IOPCTL_PIO_INBUF_EN |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI |
                                /* Selects transmitter current drive 33ohm */
                                IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN1 (coords: B20) is configured as SDHC0_CMD */
    IOPCTL_PinMuxSet(BOARD_INITSDCARDPINS_SDHC0_CMD_PORT, BOARD_INITSDCARDPINS_SDHC0_CMD_PIN, SDHC0_CMD);

    const uint32_t SD_PWREN_B = (/* Pin is configured as PIO7_10 */
                                 IOPCTL_PIO_FUNC0 |
                                 /* Disable pull-up / pull-down function */
                                 IOPCTL_PIO_PUPD_DI |
                                 /* Enable pull-down function */
                                 IOPCTL_PIO_PULLDOWN_EN |
                                 /* Disable input buffer function */
                                 IOPCTL_PIO_INBUF_DI |
                                 /* Pseudo Output Drain is disabled */
                                 IOPCTL_PIO_PSEDRAIN_DI |
                                 /* Input function is not inverted */
                                 IOPCTL_PIO_INV_DI |
                                 /* Selects transmitter current drive 100ohm */
                                 IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN10 (coords: A24) is configured as PIO7_10 */
    IOPCTL_PinMuxSet(BOARD_INITSDCARDPINS_SD_PWREN_B_PORT, BOARD_INITSDCARDPINS_SD_PWREN_B_PIN, SD_PWREN_B);

    const uint32_t SDHC0_CARD_DET_N = (/* Pin is configured as PIO7_11 */
                                       IOPCTL_PIO_FUNC0 |
                                       /* Disable pull-up / pull-down function */
                                       IOPCTL_PIO_PUPD_DI |
                                       /* Enable pull-down function */
                                       IOPCTL_PIO_PULLDOWN_EN |
                                       /* Disable input buffer function */
                                       IOPCTL_PIO_INBUF_DI |
                                       /* Pseudo Output Drain is disabled */
                                       IOPCTL_PIO_PSEDRAIN_DI |
                                       /* Input function is not inverted */
                                       IOPCTL_PIO_INV_DI |
                                       /* Selects transmitter current drive 100ohm */
                                       IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN11 (coords: F18) is configured as PIO7_11 */
    IOPCTL_PinMuxSet(BOARD_INITSDCARDPINS_SDHC0_CARD_DET_N_PORT, BOARD_INITSDCARDPINS_SDHC0_CARD_DET_N_PIN, SDHC0_CARD_DET_N);

    const uint32_t SD_VSELECT = (/* Pin is configured as PIO7_3 */
                                 IOPCTL_PIO_FUNC0 |
                                 /* Disable pull-up / pull-down function */
                                 IOPCTL_PIO_PUPD_DI |
                                 /* Enable pull-down function */
                                 IOPCTL_PIO_PULLDOWN_EN |
                                 /* Disable input buffer function */
                                 IOPCTL_PIO_INBUF_DI |
                                 /* Pseudo Output Drain is disabled */
                                 IOPCTL_PIO_PSEDRAIN_DI |
                                 /* Input function is not inverted */
                                 IOPCTL_PIO_INV_DI |
                                 /* Selects transmitter current drive 100ohm */
                                 IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN3 (coords: C21) is configured as PIO7_3 */
    IOPCTL_PinMuxSet(BOARD_INITSDCARDPINS_SD_VSELECT_PORT, BOARD_INITSDCARDPINS_SD_VSELECT_PIN, SD_VSELECT);

    const uint32_t SDHC0_DATA0 = (/* Pin is configured as SDHC0_DATA0 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Enable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_EN |
                                  /* Enable pull-up function */
                                  IOPCTL_PIO_PULLUP_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 33ohm */
                                  IOPCTL_PIO_DRIVE_33OHM);
    /* PORT7 PIN6 (coords: A22) is configured as SDHC0_DATA0 */
    IOPCTL_PinMuxSet(BOARD_INITSDCARDPINS_SDHC0_DATA0_PORT, BOARD_INITSDCARDPINS_SDHC0_DATA0_PIN, SDHC0_DATA0);

