nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/coex_examples/coex_wifi_edgefast_open/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitCODEC_I2CPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitCODEC_I2CPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t port1_pin17_config = (/* Pin is configured as LP_FLEXCOMM3_P1 */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Pseudo Output Drain is enabled */
                                         IOPCTL_PIO_PSEDRAIN_EN |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN17 (coords: AC23) is configured as LP_FLEXCOMM3_P1 */
    IOPCTL_PinMuxSet(1U, 17U, port1_pin17_config);

    const uint32_t port1_pin18_config = (/* Pin is configured as LP_FLEXCOMM3_P0 */
                                         IOPCTL_PIO_FUNC1 |
                                         /* Disable pull-up / pull-down function */
                                         IOPCTL_PIO_PUPD_DI |
                                         /* Enable pull-down function */
                                         IOPCTL_PIO_PULLDOWN_EN |
                                         /* Enables input buffer function */
                                         IOPCTL_PIO_INBUF_EN |
                                         /* Pseudo Output Drain is enabled */
                                         IOPCTL_PIO_PSEDRAIN_EN |
                                         /* Input function is not inverted */
                                         IOPCTL_PIO_INV_DI |
                                         /* Selects transmitter current drive 100ohm */
                                         IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN18 (coords: AD24) is configured as LP_FLEXCOMM3_P0 */
    IOPCTL_PinMuxSet(1U, 18U, port1_pin18_config);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitI2SPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: R24, peripheral: SAI0, signal: RX_BCLK, pin_signal: PIO0_0/LP_FLEXCOMM8_P2/SCT0_GPIN0/SCT0_OUT0/CTIMER_C_INP9/SAI0_RX_BCLK/SAI1_TX_BCLK, input_buffer: enable}
  - {pin_num: P24, peripheral: SAI0, signal: RX_SYNC, pin_signal: PIO0_1/LP_FLEXCOMM8_P3/SCT0_GPIN1/SCT0_OUT1/CTIMER0_MAT0/SAI0_RX_SYNC/SAI1_RX_DATA, input_buffer: enable}
  - {pin_num: T24, peripheral: SAI0, signal: RXD0, pin_signal: PIO0_2/LP_FLEXCOMM8_P4/SCT0_GPIN2/SCT0_OUT2/CTIMER0_MAT1/SAI0_RX_DATA/LP_FLEXCOMM9_P0, identifier: SAI0_RXD0,
    input_buffer: enable}
  - {pin_num: T25, peripheral: SAI0, signal: TX_BCLK, pin_signal: PIO0_3/LP_FLEXCOMM4_P0/SCT0_GPIN3/SCT0_OUT3/CTIMER0_MAT2/SAI0_TX_BCLK, input_buffer: enable}
  - {pin_num: V25, peripheral: SAI0, signal: TXD0, pin_signal: PIO0_4/LP_FLEXCOMM4_P1/SCT0_GPIN4/SCT0_OUT4/CTIMER0_MAT3/SAI0_TX_DATA, identifier: SAI0_TXD0, input_buffer: enable}
  - {pin_num: T23, peripheral: SAI0, signal: TX_SYNC, pin_signal: PIO0_5/LP_FLEXCOMM4_P4/SCT0_GPIN5/SCT0_OUT5/CTIMER2_MAT0/SAI0_TX_SYNC/CLKCTL0_MCLK/LP_FLEXCOMM9_P1,
    input_buffer: enable}
  - {pin_num: AB25, peripheral: CLKCTL0, signal: MCLK, pin_signal: PIO0_21/LP_FLEXCOMM6_P0/SCT0_GPIN6/SCT0_OUT6/CTIMER_C_INP4/SAI1_TX_DATA/CLKCTL0_MCLK, direction: OUTPUT,
    input_buffer: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitI2SPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitI2SPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t PIO0_0_DBG_OVER_USB = (/* Pin is configured as SAI0_RX_BCLK */
                                          IOPCTL_PIO_FUNC5 |
                                          /* Disable pull-up / pull-down function */
                                          IOPCTL_PIO_PUPD_DI |
                                          /* Enable pull-down function */
                                          IOPCTL_PIO_PULLDOWN_EN |
                                          /* Enables input buffer function */
                                          IOPCTL_PIO_INBUF_EN |
                                          /* Pseudo Output Drain is disabled */
                                          IOPCTL_PIO_PSEDRAIN_DI |
                                          /* Input function is not inverted */
                                          IOPCTL_PIO_INV_DI |
                                          /* Selects transmitter current drive 100ohm */
                                          IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN0 (coords: R24) is configured as SAI0_RX_BCLK */
    IOPCTL_PinMuxSet(BOARD_INITI2SPINS_PIO0_0_DBG_OVER_USB_PORT, BOARD_INITI2SPINS_PIO0_0_DBG_OVER_USB_PIN, PIO0_0_DBG_OVER_USB);

    const uint32_t SAI0_RX_SYNC = (/* Pin is configured as SAI0_RX_SYNC */
                                   IOPCTL_PIO_FUNC5 |
                                   /* Disable pull-up / pull-down function */
                                   IOPCTL_PIO_PUPD_DI |
                                   /* Enable pull-down function */
                                   IOPCTL_PIO_PULLDOWN_EN |
                                   /* Enables input buffer function */
                                   IOPCTL_PIO_INBUF_EN |
                                   /* Pseudo Output Drain is disabled */
                                   IOPCTL_PIO_PSEDRAIN_DI |
                                   /* Input function is not inverted */
                                   IOPCTL_PIO_INV_DI |
                                   /* Selects transmitter current drive 100ohm */
                                   IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN1 (coords: P24) is configured as SAI0_RX_SYNC */
    IOPCTL_PinMuxSet(BOARD_INITI2SPINS_SAI0_RX_SYNC_PORT, BOARD_INITI2SPINS_SAI0_RX_SYNC_PIN, SAI0_RX_SYNC);

    const uint32_t SAI0_RXD0 = (/* Pin is configured as SAI0_RX_DATA0 */
                                IOPCTL_PIO_FUNC5 |
                                /* Disable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_DI |
                                /* Enable pull-down function */
                                IOPCTL_PIO_PULLDOWN_EN |
                                /* Enables input buffer function */
                                IOPCTL_PIO_INBUF_EN |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI |
                                /* Selects transmitter current drive 100ohm */
                                IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN2 (coords: T24) is configured as SAI0_RX_DATA0 */
    IOPCTL_PinMuxSet(BOARD_INITI2SPINS_SAI0_RXD0_PORT, BOARD_INITI2SPINS_SAI0_RXD0_PIN, SAI0_RXD0);

    const uint32_t SAI0_MCLK = (/* Pin is configured as CLKCTL0_MCLK */
                                IOPCTL_PIO_FUNC6 |
                                /* Disable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_DI |
                                /* Enable pull-down function */
                                IOPCTL_PIO_PULLDOWN_EN |
                                /* Enables input buffer function */
                                IOPCTL_PIO_INBUF_EN |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI |
                                /* Selects transmitter current drive 100ohm */
                                IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN21 (coords: AB25) is configured as CLKCTL0_MCLK */
    IOPCTL_PinMuxSet(BOARD_INITI2SPINS_SAI0_MCLK_PORT, BOARD_INITI2SPINS_SAI0_MCLK_PIN, SAI0_MCLK);

    const uint32_t SAI0_TX_BCLK = (/* Pin is configured as SAI0_TX_BCLK */
                                   IOPCTL_PIO_FUNC5 |
                                   /* Disable pull-up / pull-down function */
                                   IOPCTL_PIO_PUPD_DI |
                                   /* Enable pull-down function */
                                   IOPCTL_PIO_PULLDOWN_EN |
                                   /* Enables input buffer function */
                                   IOPCTL_PIO_INBUF_EN |
                                   /* Pseudo Output Drain is disabled */
                                   IOPCTL_PIO_PSEDRAIN_DI |
                                   /* Input function is not inverted */
                                   IOPCTL_PIO_INV_DI |
                                   /* Selects transmitter current drive 100ohm */
                                   IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN3 (coords: T25) is configured as SAI0_TX_BCLK */
    IOPCTL_PinMuxSet(BOARD_INITI2SPINS_SAI0_TX_BCLK_PORT, BOARD_INITI2SPINS_SAI0_TX_BCLK_PIN, SAI0_TX_BCLK);

    const uint32_t SAI0_TXD0 = (/* Pin is configured as SAI0_TX_DATA0 */
                                IOPCTL_PIO_FUNC5 |
                                /* Disable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_DI |
                                /* Enable pull-down function */
                                IOPCTL_PIO_PULLDOWN_EN |
                                /* Enables input buffer function */
                                IOPCTL_PIO_INBUF_EN |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI |
                                /* Selects transmitter current drive 100ohm */
                                IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN4 (coords: V25) is configured as SAI0_TX_DATA0 */
    IOPCTL_PinMuxSet(BOARD_INITI2SPINS_SAI0_TXD0_PORT, BOARD_INITI2SPINS_SAI0_TXD0_PIN, SAI0_TXD0);

    const uint32_t SAI0_TX_SYNC = (/* Pin is configured as SAI0_TX_SYNC */
                                   IOPCTL_PIO_FUNC5 |
                                   /* Disable pull-up / pull-down function */
                                   IOPCTL_PIO_PUPD_DI |
                                   /* Enable pull-down function */
                                   IOPCTL_PIO_PULLDOWN_EN |
                                   /* Enables input buffer function */
                                   IOPCTL_PIO_INBUF_EN |
                                   /* Pseudo Output Drain is disabled */
                                   IOPCTL_PIO_PSEDRAIN_DI |
                                   /* Input function is not inverted */
                                   IOPCTL_PIO_INV_DI |
                                   /* Selects transmitter current drive 100ohm */
                                   IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN5 (coords: T23) is configured as SAI0_TX_SYNC */
    IOPCTL_PinMuxSet(BOARD_INITI2SPINS_SAI0_TX_SYNC_PORT, BOARD_INITI2SPINS_SAI0_TX_SYNC_PIN, SAI0_TX_SYNC);

    SYSCON0->SAI0_MCLK_CTRL = ((SYSCON0->SAI0_MCLK_CTRL &
                                /* Mask bits to zero which are setting */
                                (~(SYSCON0_SAI0_MCLK_CTRL_SAIMCLKDIR_MASK)))

                               /* SAI0-2 MCLK Direction Control: Output */
                               | SYSCON0_SAI0_MCLK_CTRL_SAIMCLKDIR(SAI0_MCLK_CTRL_SAIMCLKDIR_SAIMCLKOEN_1));
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitBUTTONsPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: V23, peripheral: GPIO0, signal: 'GPIO, 10', pin_signal: PIO0_10/LP_FLEXCOMM5_P0/SCT0_GPIN4/SCT0_OUT4/CTIMER1_MAT0/CTIMER_C_INP0/SAI2_RX_DATA, direction: INPUT,
    input_buffer: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

