nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/coex_examples/coex_wifi_edgefast_open/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBUTTONsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitBUTTONsPins(void)
{

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    gpio_pin_config_t USER_Button1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_10 (pin V23)  */
    GPIO_PinInit(BOARD_INITPINSBUTTON_SW5_GPIO, BOARD_INITPINSBUTTON_SW5_PIN, &USER_Button1_config);
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t USER_Button1 = (/* Pin is configured as PIO0_10 */
                                   IOPCTL_PIO_FUNC0 |
                                   /* Disable pull-up / pull-down function */
                                   IOPCTL_PIO_PUPD_DI |
                                   /* Enable pull-down function */
                                   IOPCTL_PIO_PULLDOWN_EN |
                                   /* Enables input buffer function */
                                   IOPCTL_PIO_INBUF_EN |
                                   /* Pseudo Output Drain is disabled */
                                   IOPCTL_PIO_PSEDRAIN_DI |
                                   /* Input function is not inverted */
                                   IOPCTL_PIO_INV_DI |
                                   /* Selects transmitter current drive 100ohm */
                                   IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN10 (coords: V23) is configured as PIO0_10 */
    IOPCTL_PinMuxSet(BOARD_INITPINSBUTTON_SW5_PORT, BOARD_INITPINSBUTTON_SW5_PIN, USER_Button1);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDsPins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: AD23, peripheral: GPIO1, signal: 'GPIO, 13', pin_signal: PIO1_13/LP_FLEXCOMM2_P4/UTICK0_CAP1/CTIMER2_MAT3/SWD_TRACEDATA2/32KHZ_CLKOUT, direction: OUTPUT}
  - {pin_num: AB24, peripheral: GPIO0, signal: 'GPIO, 19', pin_signal: PIO0_19/LP_FLEXCOMM6_P2/SCT0_GPIN2/SCT0_OUT2/CTIMER2_MAT2/SAI1_RX_SYNC, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitLEDsPins(void)
{

    /* Enables the clock for the GPIO0 module */
    CLOCK_EnableClock(kCLOCK_Gpio0);

    /* Enables the clock for the GPIO1 module */
    CLOCK_EnableClock(kCLOCK_Gpio1);

    gpio_pin_config_t P0_19_PWM_BLU_LED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO0_19 (pin AB24)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_P0_19_PWM_BLU_LED_GPIO, BOARD_INITLEDSPINS_P0_19_PWM_BLU_LED_PIN, &P0_19_PWM_BLU_LED_config);

    gpio_pin_config_t P1_13_PWM_GRN_LED_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PIO1_13 (pin AD23)  */
    GPIO_PinInit(BOARD_INITLEDSPINS_P1_13_PWM_GRN_LED_GPIO, BOARD_INITLEDSPINS_P1_13_PWM_GRN_LED_PIN, &P1_13_PWM_GRN_LED_config);
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t P0_19_PWM_BLU_LED = (/* Pin is configured as PIO0_19 */
                                        IOPCTL_PIO_FUNC0 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN19 (coords: AB24) is configured as PIO0_19 */
    IOPCTL_PinMuxSet(BOARD_INITLEDSPINS_P0_19_PWM_BLU_LED_PORT, BOARD_INITLEDSPINS_P0_19_PWM_BLU_LED_PIN, P0_19_PWM_BLU_LED);

    const uint32_t P1_13_PWM_GRN_LED = (/* Pin is configured as PIO1_13 */
                                        IOPCTL_PIO_FUNC0 |
                                        /* Disable pull-up / pull-down function */
                                        IOPCTL_PIO_PUPD_DI |
                                        /* Enable pull-down function */
                                        IOPCTL_PIO_PULLDOWN_EN |
                                        /* Disable input buffer function */
                                        IOPCTL_PIO_INBUF_DI |
                                        /* Pseudo Output Drain is disabled */
                                        IOPCTL_PIO_PSEDRAIN_DI |
                                        /* Input function is not inverted */
                                        IOPCTL_PIO_INV_DI |
                                        /* Selects transmitter current drive 100ohm */
                                        IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN13 (coords: AD23) is configured as PIO1_13 */
    IOPCTL_PinMuxSet(BOARD_INITLEDSPINS_P1_13_PWM_GRN_LED_PORT, BOARD_INITLEDSPINS_P1_13_PWM_GRN_LED_PIN, P1_13_PWM_GRN_LED);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitXSPI0Pins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: B2, peripheral: XSPI0, signal: SCLK0, pin_signal: PIO6_1/XSPI0_SCLK0/LP_FLEXCOMM10_P0, input_buffer: enable}
  - {pin_num: H6, peripheral: XSPI0, signal: SS0_N, pin_signal: PIO6_2/XSPI0_SS0_N/LP_FLEXCOMM10_P1, input_buffer: enable}
  - {pin_num: F6, peripheral: XSPI0, signal: 'DATA, 0', pin_signal: PIO6_3/XSPI0_DATA0/LP_FLEXCOMM10_P2, input_buffer: enable}
  - {pin_num: B3, peripheral: XSPI0, signal: 'DATA, 1', pin_signal: PIO6_4/XSPI0_DATA1/LP_FLEXCOMM10_P3, input_buffer: enable}
  - {pin_num: E8, peripheral: XSPI0, signal: 'DATA, 2', pin_signal: PIO6_5/XSPI0_DATA2/LP_FLEXCOMM10_P4, input_buffer: enable}
  - {pin_num: A4, peripheral: XSPI0, signal: 'DATA, 3', pin_signal: PIO6_6/XSPI0_DATA3/LP_FLEXCOMM10_P5, input_buffer: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

