nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/coex_examples/coex_wifi_edgefast_open/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBT_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitBT_UARTPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t BT_UART_RXD = (/* Pin is configured as LP_FLEXCOMM2_P0 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Enable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_EN |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN11 (coords: AD22) is configured as LP_FLEXCOMM2_P0 */
    IOPCTL_PinMuxSet(BOARD_INITBT_UARTPINS_BT_UART_RXD_PORT, BOARD_INITBT_UARTPINS_BT_UART_RXD_PIN, BT_UART_RXD);

    const uint32_t BT_UART_TXD = (/* Pin is configured as LP_FLEXCOMM2_P1 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Enable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_EN |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLUP_EN |
                                  /* Disable input buffer function */
                                  IOPCTL_PIO_INBUF_DI |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN12 (coords: AE22) is configured as LP_FLEXCOMM2_P1 */
    IOPCTL_PinMuxSet(BOARD_INITBT_UARTPINS_BT_UART_TXD_PORT, BOARD_INITBT_UARTPINS_BT_UART_TXD_PIN, BT_UART_TXD);

    const uint32_t BT_UART_RTS = (/* Pin is configured as LP_FLEXCOMM2_P2 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Enable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_EN |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLUP_EN |
                                  /* Disable input buffer function */
                                  IOPCTL_PIO_INBUF_DI |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN14 (coords: AE24) is configured as LP_FLEXCOMM2_P2 */
    IOPCTL_PinMuxSet(BOARD_INITBT_UARTPINS_BT_UART_RTS_PORT, BOARD_INITBT_UARTPINS_BT_UART_RTS_PIN, BT_UART_RTS);

    const uint32_t BT_UART_CTS = (/* Pin is configured as LP_FLEXCOMM2_P3 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Enable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_EN |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLUP_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN15 (coords: Y21) is configured as LP_FLEXCOMM2_P3 */
    IOPCTL_PinMuxSet(BOARD_INITBT_UARTPINS_BT_UART_CTS_PORT, BOARD_INITBT_UARTPINS_BT_UART_CTS_PIN, BT_UART_CTS);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitSDHC1Pins:
- options: {callFromInitBoot: 'false', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: V3, peripheral: USDHC1, signal: 'USDHC_DATA, 0', pin_signal: PIO7_19/SDHC1_DATA0/LP_FLEXCOMM1_P4/LP_FLEXCOMM7_P3, input_buffer: enable, pull_select: up,
    pull_enable: enable}
  - {pin_num: Y2, peripheral: USDHC1, signal: 'USDHC_DATA, 1', pin_signal: PIO7_20/SDHC1_DATA1/LP_FLEXCOMM1_P5/LP_FLEXCOMM2_P4, input_buffer: enable, pull_select: up,
    pull_enable: enable}
  - {pin_num: R2, peripheral: USDHC1, signal: 'USDHC_DATA, 2', pin_signal: PIO7_21/SDHC1_DATA2/LP_FLEXCOMM1_P6/LP_FLEXCOMM2_P5, input_buffer: enable, pull_select: up,
    pull_enable: enable}
  - {pin_num: T2, peripheral: USDHC1, signal: 'USDHC_DATA, 3', pin_signal: PIO7_22/SDHC1_DATA3/LP_FLEXCOMM2_P2, input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: T3, peripheral: USDHC1, signal: USDHC_CMD, pin_signal: PIO7_18/SDHC1_CMD/LP_FLEXCOMM2_P1, input_buffer: enable, pull_select: up, pull_enable: enable}
  - {pin_num: U3, peripheral: USDHC1, signal: USDHC_CLK, pin_signal: PIO7_17/SDHC1_CLK/LP_FLEXCOMM2_P0, input_buffer: enable, pull_select: up, pull_enable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

