nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt700/coex_examples/coex_wifi_edgefast_open/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitSDHC1Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitSDHC1Pins(void)
{
    /* Reset IOPCTL2 module */
    RESET_ClearPeripheralReset(kIOPCTL2_RST_SHIFT_RSTn);

    const uint32_t SDHC1_CLK = (/* Pin is configured as SDHC1_CLK */
                                IOPCTL_PIO_FUNC1 |
                                /* Enable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_EN |
                                /* Enable pull-up function */
                                IOPCTL_PIO_PULLUP_EN |
                                /* Enables input buffer function */
                                IOPCTL_PIO_INBUF_EN |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI |
                                /* Selects transmitter current drive 100ohm */
                                IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN17 (coords: U3) is configured as SDHC1_CLK */
    IOPCTL_PinMuxSet(BOARD_INITSDHC1PINS_SDHC1_CLK_PORT, BOARD_INITSDHC1PINS_SDHC1_CLK_PIN, SDHC1_CLK);

    const uint32_t SDHC1_CMD = (/* Pin is configured as SDHC1_CMD */
                                IOPCTL_PIO_FUNC1 |
                                /* Enable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_EN |
                                /* Enable pull-up function */
                                IOPCTL_PIO_PULLUP_EN |
                                /* Enables input buffer function */
                                IOPCTL_PIO_INBUF_EN |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI |
                                /* Selects transmitter current drive 100ohm */
                                IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN18 (coords: T3) is configured as SDHC1_CMD */
    IOPCTL_PinMuxSet(BOARD_INITSDHC1PINS_SDHC1_CMD_PORT, BOARD_INITSDHC1PINS_SDHC1_CMD_PIN, SDHC1_CMD);

    const uint32_t SDHC1_DATA0 = (/* Pin is configured as SDHC1_DATA0 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Enable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_EN |
                                  /* Enable pull-up function */
                                  IOPCTL_PIO_PULLUP_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN19 (coords: V3) is configured as SDHC1_DATA0 */
    IOPCTL_PinMuxSet(BOARD_INITSDHC1PINS_SDHC1_DATA0_PORT, BOARD_INITSDHC1PINS_SDHC1_DATA0_PIN, SDHC1_DATA0);

    const uint32_t SDHC1_DATA1 = (/* Pin is configured as SDHC1_DATA1 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Enable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_EN |
                                  /* Enable pull-up function */
                                  IOPCTL_PIO_PULLUP_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN20 (coords: Y2) is configured as SDHC1_DATA1 */
    IOPCTL_PinMuxSet(BOARD_INITSDHC1PINS_SDHC1_DATA1_PORT, BOARD_INITSDHC1PINS_SDHC1_DATA1_PIN, SDHC1_DATA1);

    const uint32_t SDHC1_DATA2 = (/* Pin is configured as SDHC1_DATA2 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Enable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_EN |
                                  /* Enable pull-up function */
                                  IOPCTL_PIO_PULLUP_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN21 (coords: R2) is configured as SDHC1_DATA2 */
    IOPCTL_PinMuxSet(BOARD_INITSDHC1PINS_SDHC1_DATA2_PORT, BOARD_INITSDHC1PINS_SDHC1_DATA2_PIN, SDHC1_DATA2);

    const uint32_t SDHC1_DATA3 = (/* Pin is configured as SDHC1_DATA3 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Enable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_EN |
                                  /* Enable pull-up function */
                                  IOPCTL_PIO_PULLUP_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT7 PIN22 (coords: T2) is configured as SDHC1_DATA3 */
    IOPCTL_PinMuxSet(BOARD_INITSDHC1PINS_SDHC1_DATA3_PORT, BOARD_INITSDHC1PINS_SDHC1_DATA3_PIN, SDHC1_DATA3);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPinsOctalFlash:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: D16, peripheral: XSPI0, signal: SCLK0_N, pin_signal: PIO6_0, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: D17, peripheral: XSPI0, signal: SCLK0, pin_signal: PIO6_1, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: G11, peripheral: XSPI0, signal: SS0_N, pin_signal: PIO6_2, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: F13, peripheral: XSPI0, signal: 'DATA, 0', pin_signal: PIO6_3, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: D14, peripheral: XSPI0, signal: 'DATA, 1', pin_signal: PIO6_4, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: C15, peripheral: XSPI0, signal: 'DATA, 2', pin_signal: PIO6_5, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: E13, peripheral: XSPI0, signal: 'DATA, 3', pin_signal: PIO6_6, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: D15, peripheral: XSPI0, signal: DQS0, pin_signal: PIO6_7, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: G13, peripheral: XSPI0, signal: 'DATA, 4', pin_signal: PIO6_8, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: F15, peripheral: XSPI0, signal: 'DATA, 5', pin_signal: PIO6_9, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: E14, peripheral: XSPI0, signal: 'DATA, 6', pin_signal: PIO6_10, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: F14, peripheral: XSPI0, signal: 'DATA, 7', pin_signal: PIO6_11, InputBufferEnable: enable, PullSelect: down}
  - {pin_num: G10, peripheral: XSPI0, signal: SS1_N, pin_signal: PIO6_12, InputBufferEnable: enable, PullSelect: down}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

